package kurdical

// WeekdayNames holds the weekday names for Kurdish (same for all dialects).
var WeekdayNames = []string{
	"",          // 0 not used
	"شەممە",     // Saturday
	"یەکشەممە",  // Sunday
	"دووشەممە",  // Monday
	"سێشەممە",   // Tuesday
	"چوارشەممە", // Wednesday
	"پێنجشەممە", // Thursday
	"هەینی",     // Friday
}

// monthNames holds the month names for each Kurdish dialect.
var monthNames = map[Dialect][]string{
	Laki: {
		"په‌نجه",
		"میریان",
		"گاکور",
		"ئاگرانی",
		"مردار",
		"ماله‌ژیر",
		"ماله‌ژیر دوماینه",
		"تۊلته‌کن",
		"مانگ سیه",
		"نورووژ",
		"خاکه لیه",
		"مانگ لیه",
	},
	Hawrami: {
		"نه‌ورۆز",
		"پاژه‌ره‌ژ",
		"چێڵکڕ",
		"کۆپڕ",
		"گه‌لاوێژ",
		"ئاوه‌وه‌ره",
		"ترازیێ",
		"گه‌ڵاخه‌زان",
		"که‌ڵه‌هه‌رز",
		"ئارگا",
		"رابڕان",
		"سیاوکام",
	},
	Sorani: {
		"خاکه‌لێوه",
		"گوڵان",
		"جۆزه‌ردان",
		"پووشپه‌ڕ",
		"گه‌لاوێژ",
		"خه‌رمانان",
		"ره‌زبه‌ر",
		"خه‌زه‌ڵوه‌ر",
		"سه‌رماوه‌ز",
		"به‌فرانبار",
		"رێبه‌ندان",
		"ره‌شه‌مێ",
	},
	Kalhuri: {
		"جه‌ژنان (جه‌شنان)",
		"گولان",
		"زه‌ردان",
		"په‌رپه‌ر",
		"گەلاویژ",
		"نوخشان",
		"به‌ران",
		"خه‌زان",
		"ساران",
		"به‌فران",
		"به‌ندان",
		"ره‌مشان",
	},
	Kurmanji: {
		"نیسان",
		"گوڵان",
		"حه‌زیران",
		"تیرمه",
		"ته‌باخ",
		"ئیلون",
		"جوتمه",
		"مژدار",
		"کانوون",
		"چله",
		"سبات",
		"ئادار",
	},
}
