package kurdical

// WeekdayNames holds the weekday names for Kurdish (same for all dialects).
var WeekdayNames = []string{
	"",                // 0 not used
	"شەممە",           // Saturday
	"یەک\u200cشەممە",  // Sunday
	"دوو\u200cشەممە",  // Monday
	"سێ\u200cشەممە",   // Tuesday
	"چوار\u200cشەممە", // Wednesday
	"پێنج\u200cشەممە", // Thursday
	"هەینی",           // Friday
}

// monthNames holds the month names for each Kurdish dialect.
var monthNames = map[Dialect][]string{
	Laki: {
		"په\u200cنجه",
		"میریان",
		"گاکور",
		"ئاگرانی",
		"مردار",
		"ماله\u200cژیر",
		"ماله\u200cژیر دوماینه",
		"تۊلته\u200cکن",
		"مانگ سیه",
		"نورووژ",
		"خاکه لیه",
		"مانگ لیه",
	},
	Hawrami: {
		"نه\u200cورۆز",
		"پاژه\u200cره\u200cژ",
		"چێڵکڕ",
		"کۆپڕ",
		"گه\u200cلاوێژ",
		"ئاوه\u200cوه\u200cره",
		"ترازیێ",
		"گه\u200cڵاخه\u200cزان",
		"که\u200cڵه\u200cهه\u200cرز",
		"ئارگا",
		"رابڕان",
		"سیاوکام",
	},
	Sorani: {
		"خاکه\u200cلێوه",
		"گوڵان",
		"جۆزه\u200cردان",
		"پووشپه\u200cڕ",
		"گه\u200cلاوێژ",
		"خه\u200cرمانان",
		"ره\u200cزبه\u200cر",
		"خه\u200cزه\u200cڵوه\u200cر",
		"سه\u200cرماوه\u200cز",
		"به\u200cفرانبار",
		"رێبه\u200cندان",
		"ره\u200cشه\u200cمێ",
	},
	Kalhuri: {
		"جه\u200cژنان (جه\u200cشنان)",
		"گولان",
		"زه\u200cردان",
		"په\u200cرپه\u200cر",
		"گەلاویژ",
		"نوخشان",
		"به\u200cران",
		"خه\u200cزان",
		"ساران",
		"به\u200cفران",
		"به\u200cندان",
		"ره\u200cمشان",
	},
	Kurmanji: {
		"نیسان",
		"گوڵان",
		"حه\u200cزیران",
		"تیرمه",
		"ته\u200cباخ",
		"ئیلون",
		"جوتمه",
		"مژدار",
		"کانوون",
		"چله",
		"سبات",
		"ئادار",
	},
}
